import random

input_count = input("Cколько пословиц Вы хотите получить? ")
# проверка ввода на корректность, если строка не состоит только из цифр тогда закрываем программу
if not input_count.isdigit():
    print("Вы ввели некорректное значение")
    exit()
# переменная для результата
results = []
# переменная с пословицами
proverbs = [
    "Ум хорошо, а два лучше.",
    "Ум — горячая штука.",
    "Ум всё голова.",
    "Умом Россию не понять.",
    "Ум бережет, а глупость губит.",
    "Ум в голову приходит.",
    "Ум от ума не горит.",
    "Умом нагружен, а волосы развеваются.",
    "Умом обдумал, а ногами пошел.",
    "Ум — сокровище, не пропадет без него и копье на ветру.",
    "Ум — грех, а бес — мера.",
    "Ум есть богатство.",
    "Ум роднит народы.",
    "Ум краток, да забот — бездна.",
    "Ум не камень, взял и положил.",
    "Ум не велит, а наставляет.",
    "Ум с мерой, а глупость без меры.",
    "Ум — сокол, глаз его — телескоп.",
    "Ум — не конская морда, не разобьешь.",
    "Ум — семь пядей во лбу.",
    "Ум — не барсук, в нору не залезет.",
    "Ум в голове, а не на ветру.",
    "Ум греет душу, а глупость терпение.",
    "Ум служит человеку, а глупость — хозяином.",
    "Ум мил, да безумству хозяин.",
    "Ум в труде, да наслаждение в праздности.",
    "Ум глаза исправляет.",
    "Ум человека не обманешь.",
    "Ум на подобии огня — без сна не останешься.",
    "Ум к уму приходит.",
    "Ум с пользой тратит время.",
    "Ум желание творит.",
    "Ум общего дела дело.",
    "Ум — друг, а воля — враг.",
    "Ум — бесценное сокровище.",
    "Ум тонок, да разум невелик.",
    "Ум — враг бедности.",
    "Ум — теремок, да не на прокол.",
    "Ум силен, да не камень.",
    "Ум рассудит, что сердце не посоветует.",
    "Ум — подкова, а топор — ось.",
    "Ум легче камня, да весомей золота.",
    "Ум не вешать на гроздья.",
    "Ум — не мешок, на плечи не вешай.",
    "Ум — лучшая победа.",
    "Ум — в суде велик, а в деле своем мал.",
    "Ум голове краса.",
    "Ум — сокровище, а глупость — нищета.",
    "Ум человека — огонь, а глаза — масло.",
    "Ум — путь, а дорога — конец.",
    "Ум стоит денег.",
    "Ум от смеха бьет в ладоши.",
    "Ум — коза, к барскому плечу привыкает.",
    "Ум — лезвие, а лень — ржавчина.",
    "Ум на вершине — мир в руках.",
]
# переменная с вариантами замены
variants = [
    'кот',
    'шеф',
    'мозг',
    'лес',
    'фолк',
    'код',
    'рот',
    'мёд',
    'лук',
    'лес',
    'год',
    'час',
    'друг',
    'муж',
    'айфон',
    'стол',
    'нос',
    'сыр',
    'хлеб',
    'мир',
    'свет',
    'рок',
    'дед',
    'дом',
    'сон',
    'глаз',
]

for count in range(int(input_count)):
    # перемешиваем список пословиц
    random.shuffle(proverbs)
    # получаем случайную пословицу и удаляем её из списка
    proverb = proverbs.pop()
    # перемешиваем список слов для замены
    random.shuffle(variants)
    # выполняем try-except, чтобы избежать ошибки IndexError
    try:
        # заменяем первое слово на случайный вариант
        proverb = proverb.replace(proverb.split()[0], variants.pop())
        # добавляем в список результатов
        results.append(proverb)
    # если ошибка, значит список слов для замены пуст, поэтому выходим из цикла
    except IndexError:
        print('Вы достигли лимита пословиц')
        break
# вывод результата
print(results)